#Домашнє завдання №1. Поворот годинникової стрілки.

a = float(input('Введіть кут повороту годинної стрілки:'))
if a > 360:
    print('Кут повороту стрілки не може перевищувати 360 градусів')
else:
    print('Хвилинна стрілка повернулася на кут:', (a % 30 * 12), 'градусів')

#Домашнє завдання №2. Внесок до банку.

x = int(input('Введіть ваш внесок до банку (грн):'))
y = int(input('Введіть процент накопичування коштів за рік:'))
n = int(input('Введіть потрібну Вам накопичену суму (грн):'))


рік = 0

while  x<n:
        x=int((x*(100+y))/100)
        рік+=1
print ('Ви накопичете потрібну суму через:', рік, 'рік (роки, років)')

print('Привіт, СА')





